<!-- dflook/terraform-github-actions {"workspace":"judo-techniques-bot","backend_type":"remote","plan_modifier":"b3d6c56855568c54dc21424da9739e859d3073ade4fffbedbfb4f72ad6c5e64f","backend":"007785df8afd9a00401b0311f80d4343eaffe3337ef8afd4129855c3a78b8ed4","plan_job_ref":"Job Terraform Plan #82 at https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/9408656803","plan_hash":"e5e915f5676f76bd6b420f3adef8aa5da993580fd37644b550da6f5fabcee557","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __./terraform__ in the __judo-techniques-bot__ workspace
Replacing resources: `aws_launch_template.launch_template`, `aws_ecs_task_definition.jtb_task_definition`
<details>
<summary>Plan: 2 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.autoscaling_group will be updated in-place
!~  resource "aws_autoscaling_group" "autoscaling_group" {
        id                               = "terraform-20231117155058700100000005"
        name                             = "terraform-20231117155058700100000005"
#        (27 unchanged attributes hidden)

!~      launch_template {
!~          id      = "********************" -> (known after apply)
            name    = "EcsClusterjtb_ecs-clusterLaunchTemplate"
!~          version = "1" -> (known after apply)
        }

#        (5 unchanged blocks hidden)
    }

  # aws_ecs_service.jtb_service will be updated in-place
!~  resource "aws_ecs_service" "jtb_service" {
        id                                 = "arn:aws:ecs:us-east-2:596332158252:service/jtb_ecs-cluster/EcsClusterjtb_ecs-clusterService"
        name                               = "EcsClusterjtb_ecs-clusterService"
        tags                               = {
            "Module" = "ECS Cluster"
            "Name"   = "jtb_ecs-cluster"
        }
!~      task_definition                    = "arn:aws:ecs:us-east-2:596332158252:task-definition/EcsClusterjtb_ecs-clusterTaskDefinition:60" -> (known after apply)
#        (13 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.jtb_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "jtb_task_definition" {
!~      arn                      = "arn:aws:ecs:us-east-2:596332158252:task-definition/EcsClusterjtb_ecs-clusterTaskDefinition:60" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-2:596332158252:task-definition/EcsClusterjtb_ecs-clusterTaskDefinition" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   cpu            = 0
-                   environment    = []
-                   essential      = true
-                   mountPoints    = []
                    name           = "jtb"
-                   portMappings   = []
-                   systemControls = []
-                   volumesFrom    = []
#                    (2 unchanged attributes hidden)
                },
            ]
        )
!~      id                       = "***************************************" -> (known after apply)
!~      revision                 = 60 -> (known after apply)
        tags                     = {
            "Module" = "ECS Cluster"
            "Name"   = "jtb_ecs-cluster"
        }
#        (7 unchanged attributes hidden)
    }

  # aws_launch_template.launch_template must be replaced
-/+ resource "aws_launch_template" "launch_template" {
!~      arn                     = "arn:aws:ec2:us-east-2:596332158252:launch-template/lt-0a882b3969c4e41bc" -> (known after apply)
!~      default_version         = 1 -> (known after apply)
-       disable_api_stop        = false -> null
-       disable_api_termination = false -> null
!~      id                      = "********************" -> (known after apply)
!~      latest_version          = 1 -> (known after apply)
        name                    = "EcsClusterjtb_ecs-clusterLaunchTemplate"
+       name_prefix             = (known after apply)
-       security_group_names    = [] -> null
-       tags                    = {} -> null
!~      tags_all                = {} -> (known after apply)
#        (5 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #82](https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/9408656803)